"Every 10 minutes" = "Cada 10 minuts";
"Manually" = "Manualment";
"Rescan" = "Reexaminar";
"Show Info" = "Mostrar informació";
"Delete selected source" = "Esborrar l'origen seleccionat";
"Every day" = "Cada dia";
"Add source..." = "Afegir origen...";
"Every half hour" = "Cada mitja hora";
"Rescan source" = "Reexaminar l'origen";
"Sources" = "Origens";
"Every hour" = "Cada hora";
"Rescan frequency" = "Frequencia de reexaminat";
